# data-database-types-relational-language-SQL-MySQL-function-built-in-date-DATE_FORMAT
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

- **formats** a **date** [1]

- different **countries** have **different** **ways** of **showing** **dates** - by **default** - **mysql** - stores dates in the format - **yyyy-mm-dd** [1]

```sql
DATE_FORMAT(date,format)
```

```sql
mysql> use school;
Database changed
```

```sql
mysql> show tables;
+------------------+
| Tables_in_school |
+------------------+
| subject          |
| teacher          |
+------------------+
2 rows in set (0.00 sec)
```

```sql
mysql> DESCRIBE teacher;
+------------+---------------+------+-----+---------+----------------+
| Field      | Type          | Null | Key | Default | Extra          |
+------------+---------------+------+-----+---------+----------------+
| tid        | int           | NO   | PRI | NULL    | auto_increment |
| Name       | varchar(20)   | YES  |     | NULL    |                |
| level      | enum('J','L') | YES  |     | NULL    |                |
| experience | int           | YES  |     | NULL    |                |
| dob        | date          | YES  |     | NULL    |                |
+------------+---------------+------+-----+---------+----------------+
5 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM teacher
    -> LIMIT 5;
+-----+--------------+-------+------------+------------+
| tid | Name         | level | experience | dob        |
+-----+--------------+-------+------------+------------+
|   1 | Mr. Pasteur  | L     |         15 | 1960-02-02 |
|   2 | Ms. Dubois   | L     |         22 | 1967-09-02 |
|   3 | Ms. Smith    | J     |          4 | 1980-03-23 |
|   4 | Mr. Hawking  | L     |         40 | 1951-02-19 |
|   5 | Mr. Kavanagh | J     |         50 | 1949-11-01 |
+-----+--------------+-------+------------+------------+
5 rows in set (0.00 sec)
```

```sql
mysql> SELECT dob
    -> FROM teacher
    -> WHERE tid=5;
+------------+
| dob        |
+------------+
| 1949-11-01 |
+------------+
1 row in set (0.00 sec)
```

```sql
mysql> SELECT dob as Birthday
    -> FROM teacher
    -> WHERE tid=5;
+------------+
| Birthday   |
+------------+
| 1949-11-01 |
+------------+
1 row in set (0.00 sec)
```

- show date - dd-mm-yy [1]

```sql
mysql> SELECT DATE_FORMAT(dob,"%d-%m-%y")
    -> FROM teacher
    -> WHERE tid=5;
+-----------------------------+
| DATE_FORMAT(dob,"%d-%m-%y") |
+-----------------------------+
| 01-11-49                    |
+-----------------------------+
1 row in set (0.00 sec)
```

- show date - mm-dd-yy [1]

```sql
mysql> SELECT DATE_FORMAT(dob,"%m/%d/%y")
    -> FROM teacher
    -> WHERE tid=5;
+-----------------------------+
| DATE_FORMAT(dob,"%m/%d/%y") |
+-----------------------------+
| 11/01/49                    |
+-----------------------------+
1 row in set (0.00 sec)
```

- **alias** to **remove** - function - **DATE_FORMAT** - **printed** - renames the column - attribute - field - dob [1]

```sql
DATE_FORMAT(dob,"%m/%d/%y")
```

```sql
mysql> SELECT DATE_FORMAT(dob,"%m/%d/%y") as dob
    -> FROM teacher
    -> WHERE tid=5;
+----------+
| dob      |
+----------+
| 11/01/49 |
+----------+
1 row in set (0.00 sec)
```

***
# END